In [1]:
import numpy as np
import pandas as pd

### 1.创建DataFrame
#### 字典类型，值为Series

In [2]:
lst = [1,2,3,4]
a = pd.Series(lst)
a

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
a.index = ['a','b','c','d']

In [4]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
b = pd.Series([1,2,3],index=['a','b','c'])
b

a    1
b    2
c    3
dtype: int64

In [6]:
dct = {'one':a,'two':b}
dct

{'one': a    1
 b    2
 c    3
 d    4
 dtype: int64, 'two': a    1
 b    2
 c    3
 dtype: int64}

In [8]:
dt = pd.DataFrame(dct)
dt

   one  two
a    1  1.0
b    2  2.0
c    3  3.0
d    4  NaN

#### 字典类型，值为列表或数组

In [5]:
lst1 = [1,2,3]
ar1 = np.array([1,2,3])
ar1

array([1, 2, 3])

In [7]:
dct1 = {'a1':lst1,'a2':ar1}
dct1

{'a1': [1, 2, 3], 'a2': array([1, 2, 3])}

In [9]:
df1 = pd.DataFrame(dct1)
df1

   a1  a2
0   1   1
1   2   2
2   3   3

#### 列表类型，值为字典

In [11]:
lst2 = [{'b1':1,'c1':3},{'b2':2,'d1':4},{'e1':5,'f1':6}]
lst2

[{'b1': 1, 'c1': 3}, {'b2': 2, 'd1': 4}, {'e1': 5, 'f1': 6}]

In [13]:
df2 = pd.DataFrame(lst2)
df2

    b1   c1   b2   d1   e1   f1
0  1.0  3.0  NaN  NaN  NaN  NaN
1  NaN  NaN  2.0  4.0  NaN  NaN
2  NaN  NaN  NaN  NaN  5.0  6.0

In [15]:
lst3 = [{'b1':1,'c1':3},{'b1':2,'c1':4},{'b1':5,'c1':6}]
df3 = pd.DataFrame(lst3)
df3

   b1  c1
0   1   3
1   2   4
2   5   6

### 2.数据的选择

In [21]:
df = pd.DataFrame(np.random.randint(1,15,(10,5)),columns=list('ABCDE'))
df

    A   B   C   D   E
0   9   3  10   7   9
1   7   5   5  11   3
2   7  10   2  14   2
3   9   4  11   5  12
4  14  11   3   3   4
5  10   9   6   6   8
6  10   4   6   7   9
7   7  11  12  12   1
8   1   5   5   7  11
9   9   7  11   6  10

#### 常用选择方式
##### 1列表直接获取

In [23]:
#返回Series
df['A']

0     9
1     7
2     7
3     9
4    14
5    10
6    10
7     7
8     1
9     9
Name: A, dtype: int32

In [25]:
df['A'][1:3]

1    7
2    7
Name: A, dtype: int32

In [26]:
df['A'][[1,3]]

1    7
3    9
Name: A, dtype: int32

In [9]:
dt.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
dt.columns

Index(['one', 'two'], dtype='object')

In [12]:
dt.values

array([[ 1.,  1.],
       [ 2.,  2.],
       [ 3.,  3.],
       [ 4., nan]])

In [13]:
dt1 =  dt.copy()

In [15]:
dt1.index = [1,2,3,4]
dt1

   one  two
1    1  1.0
2    2  2.0
3    3  3.0
4    4  NaN

In [33]:
a = np.random.randint(2,7,(2,3))
a

array([[4, 4, 6],
       [5, 3, 3]])

In [39]:
b = pd.DataFrame(a,index=list('ab'),columns=list('wah'))

In [40]:
b

   w  a  h
a  4  4  6
b  5  3  3

In [42]:
b['w'][1]

5